content/shortcut.org
#+TITLE:MacOSの便利ショートカット
#+options: num:nil \n:t
#+LANGUAGE: ja
#+MACRO: ruby @@latex:\ltjruby{$1}{$2}@@ @@html:<ruby>$1<rt>$2</rt></ruby>@@

[[file:index.org][トップへ戻る]]

MacOSには，デフォルトで知っておくと便利なショートカットがいっぱいある．
普段使っているもの以外にも，覚えておいて損はしないショートカットたちを紹介しよう．
* ⌘系ショートカット
こちらはみんなおなじみのショートカットばかりだと思う．
全てを列挙してもしょうがないので，作者がよくお世話になっているものを紹介しょう．

#+ATTR_HTML: :align center
|       <c>       | <l>              | <l>                                                                               |
|-----------------+------------------+-----------------------------------------------------------------------------------|
| ショートカット  | 機能             | 備考                                                                              |
|-----------------+------------------+-----------------------------------------------------------------------------------|
|      ⌘ + C      | コピー           | 言わずと知れた，ショートカット代表． 選択した文章などをコピーするが元は消さない． |
|      ⌘ + X      | 切り取り         | 選択した文章を消して，別の場所にペーストするときに使う．                          |
|      ⌘ + V      | ペースト         | カーソルのある位置に，文章を貼る．コピーや切り取りとセットでどうぞ．              |
|-----------------+------------------+-----------------------------------------------------------------------------------|
|     ⌘ + TAB     | アプリの切り替え | 今使っているアプリから，他に起動しているアプリに右回りで移れる                    |
| ⌘ + Shift + TAB | アプリの切り替え | 今使っているアプリから，他に起動しているアプリに左回りで移れる                    |
|                 |                  |                                                                                   |

[[file:index.org][トップへ戻る]]

# Local Variables:
# org-export-allow-bind-keywords: t
# End:
