docs/shortcut.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2026-01-04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MacOSの便利ショートカット</title>
<meta name="author" content="藤本教寛" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="static/css/style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">MacOSの便利ショートカット</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6ce433b">⌘系ショートカット</a></li>
</ul>
</div>
</div>
<p>
<a href="index.html">トップへ戻る</a><br />
</p>

<p>
MacOSには，デフォルトで知っておくと便利なショートカットがいっぱいある．<br />
普段使っているもの以外にも，覚えておいて損はしないショートカットたちを紹介しよう．<br />
</p>
<div id="outline-container-org6ce433b" class="outline-2">
<h2 id="org6ce433b">⌘系ショートカット</h2>
<div class="outline-text-2" id="text-org6ce433b">
<p>
こちらはみんなおなじみのショートカットばかりだと思う．<br />
全てを列挙してもしょうがないので，作者がよくお世話になっているものを紹介しょう．<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-center" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-center">ショートカット</th>
<th scope="col" class="org-left">機能</th>
<th scope="col" class="org-left">備考</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-center">⌘ + C</td>
<td class="org-left">コピー</td>
<td class="org-left">言わずと知れた，ショートカット代表． 選択した文章などをコピーするが元は消さない．</td>
</tr>

<tr>
<td class="org-center">⌘ + X</td>
<td class="org-left">切り取り</td>
<td class="org-left">選択した文章を消して，別の場所にペーストするときに使う．</td>
</tr>

<tr>
<td class="org-center">⌘ + V</td>
<td class="org-left">ペースト</td>
<td class="org-left">カーソルのある位置に，文章を貼る．コピーや切り取りとセットでどうぞ．</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-center">⌘ + TAB</td>
<td class="org-left">アプリの切り替え</td>
<td class="org-left">今使っているアプリから，他に起動しているアプリに右回りで移れる</td>
</tr>

<tr>
<td class="org-center">⌘ + Shift + TAB</td>
<td class="org-left">アプリの切り替え</td>
<td class="org-left">今使っているアプリから，他に起動しているアプリに左回りで移れる</td>
</tr>

<tr>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
<a href="index.html">トップへ戻る</a><br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">&copy; 藤本教寛（沖縄高専） / Yukihiro Fujimoto (Okinawa KOSEN) &nbsp;|&nbsp; 最終更新: 2026-01-04</p>
</div>
</body>
</html>
